---
kind: property
id: P:Autodesk.Revit.DB.Macros.MacroModuleIterator.CurrentObject
source: html/f4c70c6c-d0f3-0fb0-0aa5-b5bfe02fe3e8.htm
---
# Autodesk.Revit.DB.Macros.MacroModuleIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```